---
kind: type
id: T:Autodesk.Revit.DB.SATImportOptions
source: html/ae7fbb19-3fdd-0f5e-6b11-a5301e134922.htm
---
# Autodesk.Revit.DB.SATImportOptions

The import options used to import SAT format files.

## Syntax (C#)
```csharp
public class SATImportOptions : BaseImportOptions
```